/* Error string for OTR message string */
"A private conversation could not be set up." = "Egy privát beszélgetést nem lehetett beállítani.";

/* Title for the about page */
"About" = "Az alkalmazásról";

/* Label for button to show version numbers and licenses */
"About This Version" = "Erről a verzióról";

/* SSL error message */
"Access denied" = "Hozzáférés megtagadva";

/* The string describing a buddy's account */
"Account" = "Fiók";

/* Title for the accounts tab */
"Accounts" = "Fiókok";

/* Button title to add someone as a buddy */
"Add" = "Hozzáadás";

/* The title for the view to add a buddy */
"Add Buddy" = "Partner hozzáadása";

/* Label for button to create account by logging into an existing account */
"Add Existing Account" = "Add Existing Account";

/* String to describe advanced set of settings */
"Advanced" = "Haladó";

/* No comment provided by engineer. */
"Advanced Encryption Settings" = "Advanced Encryption Settings";

/* Error string for OTR message string */
"An error occured while encrypting a message and the message was not sent." = "Hiba történt egy üzenet titkosítása közben és az üzenet nem lett elküldve.";

/* SSL error message */
"Attempt to restore an unknown session" = "Ismeretlen folyamat visszaállításának megkísérlése";

/* Title for automatic conversation deletion setting */
"Auto-delete" = "Törlés automatikusan";

/* Label in buddy list for users that are available */
"Available" = "Elérhető";

/* Label in buddy list for users that are away */
"Away" = "Távol";

/* SSL error message */
"Bad certificate format" = "Hibás tanúsítvány formátum";

/* SSL error message */
"Bad MAC" = "Hibás MAC azonosító";

/* SSL error message */
"Bad protocol version" = "Hibás protokoll verzió";

/* SSL error message */
"Bad SSLCipherSuite" = "Rossz SSLCipherSuite";

/* SSL error message */
"Bad unsupported cert format" = "Hibás nem támogatott tanúsítvány formátum";

/* string to describe basic set of settings */
"Basic" = "Alapvető";

/* username section */
"Basic Setup" = "Basic Setup";

/* Text describing what happens when the user has forgotten the passphrase */
"Because the database contents is encrypted with your passphrase, you've lost access to your data and will need to delete and reinstall ChatSecure to continue. Password managers like 1Password or MiniKeePass can be helpful for generating and storing strong passwords." = "Mivel az adatbázis tartalma titkosítva van a jelmondatoddal, elveszted a hozzáférést az adataidhoz és törölnöd és újratelepítened kell a ChatSecure -t a folytatáshoz. a jelszókezelők, mint a 1Password vagy MiniKeePass hasznos lehet erős jelszavak generálására és tárolására.";

/* No comment provided by engineer. */
"Best Available" = "Best Available";

/* The String for a button to block a buddy */
"Block" = "Blokkol";

/* The String for a buddy to block and remove a buddy from the buddy list */
"Block & Remove" = "Blokkolás és eltávolítás";

/* The title for the view that shows detailed buddy info */
"Buddy Info" = "Partner infó";

/* Cancel an alert window */
"Cancel" = "Mégse";

/* Error string for OTR message string */
"Cannot read the received message." = "Nem lehet elolvasni a kapott üzenetet.";

/* Error string for OTR message string */
"Cannot recognize the type of OTR message received." = "Nem lehet felismerni a kapott OTR üzenet típusát.";

/* SSL error message */
"Cert chain not verified by root" = "A tanúsítványlánc nincs ellenőrizve root által";

/* SSL error message */
"Certificate expired" = "Tanúsítvány lejárt";

/* SSL error message */
"Certificate revoked" = "Tanúsítvány visszavonva";

/* SSL error message */
"Chain had a cert not yet valid" = "A láncnak jelenleg nem érvényes tanúsítványa volt";

/* SSL error message */
"Chain had an expired cert" = "A láncnak lejárt tanúsítványa volt";

/* Title for chat view */
"Chat" = "Beszélgetés";

/* Body of SMS or email when sharing a link to the app */
"Chat with me securely" = "Csevegj velem biztonságosan";

/* Title for chats view */
"Chats" = "Csevegések";

/* Title for ChatSecure Push (this probably doesnt need to be translated) */
"ChatSecure Push" = "ChatSecure Push";

/* let users know source is on Github */
"Check out the source here on Github" = "Nézze meg a forráskódunkat itt, a csapat GitHub tárolójában";

/* server selection footer */
"Choose from our list of trusted servers, or use your own." = "Choose from our list of trusted servers, or use your own.";

/* title for server selection screen */
"Choose Server" = "Choose Server";

/* SSL error message */
"Cipher Suite negotiation failure" = "Cipher Suite tárgyalási kudarc";

/* Label for text field where you compose a new message */
"Compose" = "Összeállít";

/* SSL error message */
"Configuration error" = "Beállítás hiba";

/* String for button to connect connect */
"Connect" = "Connect";

/* Whether or not account is logged in */
"Connected" = "Kapcsolt";

/* String to state if an account is progress of creating a connection */
"Connecting" = "Kapcsolódás";

/* Message shown when connecting to the Tor network */
"Connecting to Tor" = "Kapcsolódás Tor hálózathoz";

/* SSL error message */
"Connection closed gracefully" = "A kapcsolat lezárult elegánsan";

/* SSL error message */
"Connection closed via error" = "A kapcsolat lezárult hibával";

/* Copy string to clipboard as in copy and paste */
"Copy" = "Másolás";

/* No comment provided by engineer. */
"Could not decrypt database. If the app is not working properly, you may need to delete and reinstall." = "Could not decrypt database. If the app is not working properly, you may need to delete and reinstall.";

/* Error message when cannot get public key from SSL certificate */
"Could not retrieve public key from certificate" = "Nem lehetett visszanyerni a nyilvános kulcsot a tanúsítványból";

/* No comment provided by engineer. */
"Crash Detected" = "Crash Detected";

/* Title for button to create account */
"Create" = "Létrehozás";

/* Label for button to create a new account via in band registration */
"Create New Account" = "Új fiók létrehozása";

/* Start of sentence that will be followed by names */
"Created by" = "Készítve általa:";

/* Title for progress of creating a new account */
"Creating Account" = "Fiók létrehozása";

/* Place holder label for custom domains */
"Custom" = "Custom";

/* if you want to change your username */
"Customize Username" = "Customize Username";

/* No comment provided by engineer. */
"Database Error" = "Database Error";

/* SSL error message */
"Decoding error" = "Dekódolási hiba";

/* SSL error message */
"Decompression failure" = "Dekompressziós hiba";

/* SSL error message */
"Decryption error" = "Dekódolási hiba";

/* SSL error message */
"Decryption failed" = "Dekódolás nem sikerült";

/* SSL error message */
"Decryption failure" = "Dekódolási hiba";

/* default string to revert to normal language behaviour */
"Default" = "Alapértelmezett";

/* Ask user if they want to delete the stored account information */
"Delete Account?" = "Fiók törlése?";

/* Description for automatic conversation deletion */
"Delete chats on disconnect" = "Beszélgetések törlése szétkapcsoláskor";

/* Shows in the chat view when a message has been delivered */
"Delivered" = "Kézbesítve";

/* Default message when a user status is set to do not disturb */
"Do Not Disturb" = "Ne zavarj!";

/* No comment provided by engineer. */
"Don't change these unless you really know what you're doing. By default we will always select the best available encryption method." = "Don't change these unless you really know what you're doing. By default we will always select the best available encryption method.";

/* Title for donation link */
"Donate" = "Adakozás";

/* Title for button to press when user is finished */
"Done" = "Kész";

/* The string describing account name or email address for a buddy */
"Email" = "Email";

/* enable permission */
"Enable" = "Enable";

/* button for enabling push messages */
"Enable Push" = "Enable Push";

/* button for enabling push messages in iOS system settings */
"Enable Push in Settings" = "Enable Push in Settings";

/* No comment provided by engineer. */
"Enable Tor" = "Enable Tor";

/* Generic title for encryption errors */
"Encryption Error" = "Titkosítási hiba";

/* The placeholder text for the text field to enter a group chat name or label */
"Enter a group name" = "Enter a group name";

/* Title of error message pop-up box */
"Error" = "Error";

/* title label for error when creating account */
"Error Creating Account" = "Hiba a fiók készítésekor";

/* SSL error message */
"Export restriction" = "Export korlátozás";

/* Default message when a user status is set to extended away */
"Extended Away" = "Kiterjesztett távollét";

/* the name for facebook */
"Facebook" = "Facebook";

/* Message when cannot connect to XMPP server */
"Failed to connect to XMPP server. Please check your login credentials and internet connection and try again." = "Nem sikerült az XMPP szerverhez történő csatlakozás. Ellenőrizd a bejelentkezési adatokat és az internetkapcsolatod, majd próbálkozz újra.";

/* SSL error message */
"Fatal alert" = "Végzetes figyelmeztetés";

/* Label for button when you've forgotten the passphrase */
"Forgot Passphrase?" = "Elfelejtett jelmondat?";

/* whether or not we should generate a strong password for them */
"Generate Secure Password" = "Generate Secure Password";

/* Name of popular web based hosting service */
"GitHub" = "GitHub";

/* the name for Google talk */
"Google Talk" = "Google Talk";

/* a subtitle label for a group chat */
"Group Chat" = "Group Chat";

/* The title for the view to enter a group chat name or label */
"Group Name" = "Group Name";

/* SSL error message */
"Handshake failure" = "SSL kézfogási hiba";

/* Label for button to open link to translate app */
"Help Translate" = "Segít fordítani";

/* Label for button to hold to record audio */
"Hold to talk" = "Hold to talk";

/* Label text for hostname field on login scree */
"Hostname" = "Állomásnév";

/* SSL error message */
"I/O would block (not fatal)" = "I/O blokkolt (nem végzetes)";

/* SSL error message */
"Illegal parameter" = "Rossz paraméter";

/* Label for incoming data transfers */
"Incoming" = "Incoming";

/* Short for information, button title to get more information */
"Info" = "Infó";

/* SSL error message */
"Insufficient buffer provided" = "Elégtelen pufferrel ellátva";

/* SSL error message */
"Insufficient security" = "Elégtelen biztonság";

/* SSL error message */
"Internal error" = "Belső hiba";

/* SSL error message */
"Invalid certificate chain" = "Érvénytelen tanúsítvány lánc";

/* title label for invalid email */
"Invalid Email" = "Érvénytelen email";

/* the name for jabber, also include (XMPP) at the end */
"Jabber (XMPP)" = "Fecsegés (XMPP)";

/* Label for button after to send push notification knock. Like knocking on a door */
"Knock" = "Knock";

/* Text for label after knock is sent. Like knocking on a door */
"Knock Sent" = "Knock Sent";

/* string to bring up language selector */
"Language" = "Nyelv";

/* log in to account */
"Log In" = "Bejelentkezés";

/* log out from account */
"Log Out" = "Kijelentkezés";

/* Label for account setting that autologins on launch */
"Login Automatically" = "Automatikus bejelentkezés";

/* Title for button to manage ChatSecure Push account */
"Manage ChatSecure Push account" = "ChatSecure Push fiók kezelése";

/* subtitle for the certificate pinned setting */
"Manage saved SSL certificates" = "Mentett SSL tanúsítványok kezelése";

/* No comment provided by engineer. */
"Me" = "Me";

/* Error string for OTR message string */
"Message has not been sent because our buddy has ended the private conversation. We should either close the connection, or refresh it." = "Az üzenet nem lett elküldve, mert a partnerünk befejezte a privát beszélgetést. Nekünk is le kéne zárni a kapcsolatot, vagy frissíteni.";

/* microphone permission is disabled */
"Microphone Disabled" = "Microphone Disabled";

/* SSL error message */
"Miscellaneous bad certificate" = "Különféle hibás tanúsítvány";

/* SSL error message */
"Module attach failure" = "Modul csatolás hiba";

/* Your QR code */
"My QR Code" = "My QR Code";

/* The string describing a buddy's display name */
"Name" = "Név";

/* For a new settings value */
"New" = "Új";

/* Title for New Account View */
"New Account" = "Új fiók";

/* Title for alert when a new SSL certificate is encountered */
"New SSL Certificate" = "Új SSL tanúsítvány";

/* Label for button to go to next step */
"Next" = "Következő";

/* for choosing your XMPP vCard display name */
"Nickname" = "Nickname";

/* SSL error message */
"No Error" = "Nincs hiba";

/* SSL error message */
"No renegotiation allowed" = "Nincs újratárgyalás engedélyezve";

/* Label in buddy list for users that are offline */
"Offline" = "Offline";

/* Accept the dialog */
"OK" = "OK";

/* For an old settings value */
"Old" = "Régi";

/* Label to open link in the chrome web browser */
"Open in Chrome" = "Megnyitás Chrome-ban";

/* Label for button to open link in facebook app */
"Open in Facebook" = "Megnyitás Facebook-ban";

/* Label for button to open link in twitter app */
"Open in Twitter" = "Megnyitás Twitter-ben";

/* Hint text for domain field telling user this field is not required */
"Optional" = "Választható";

/* Title for other miscellaneous settings group */
"Other" = "Más";

/* Error string for OTR message string */
"Our policy requires encryption but we are trying to send an unencrypted message out." = "A mi irányelvünk megkívánja a titkosítást, de megpróbálunk egy titkosítatlan üzenetet kiküldeni.";

/* Label text for password field on login screen */
"Password" = "Jelszó";

/* SSL error message */
"Peer cert is valid, or was ignored if verification disabled" = "A peer tanúsítvány érvényes, vagy figyelmen kívül hagyva, ha az ellenőrzés letiltva";

/* SSL error message */
"Peer dropped connection before responding" = "A peer eldobta a kapcsolatot válaszolás előtt";

/* SSL error message */
"Peer host name mismatch" = "Peer állomásnév eltérés";

/* String for XMPP buddies when adding buddy is pending */
"Pending Approval" = "Függő jóváhagyás";

/* Ask user if they want to delete the stored account information */
"Permanently delete" = "Végleges törlés";

/* Label for button to open up photo library and choose photo */
"Photo Library" = "Photo Library";

/* Button Lable to show all pinned SSL certificates */
"Pinned Certificates" = "Rögzített tanúsítványok";

/* Label for messages that are not encrypted */
"plaintext" = "plaintext";

/* No comment provided by engineer. */
"Plaintext (Opportunistic OTR)" = "Plaintext (Opportunistic OTR)";

/* No comment provided by engineer. */
"Plaintext Only" = "Plaintext Only";

/* detail title label for invalid email */
"Please choose a valid email address" = "Kérlek válassz egy érvényes email címet";

/* Label for port number field for connecting to service */
"Port" = "Port";

/* title for contacts profile view */
"Profile" = "Profile";

/* Title for push-messaging related settings */
"Push" = "Átküldés";

/* Label for qr code image */
"QR code" = "QR kód";

/* Error string for OTR message string */
"Received a general OTR error." = "Beérkezett egy általános OTR hiba.";

/* Error string for OTR message string */
"Received a heartbeat." = "Beérkezett egy szívdobbanás.";

/* Error string for OTR message string */
"Received an encrypted message but cannot read it because no private connection is established yet." = "Beérkezett egy titkosított üzenet, de nem lehet elolvasni, mert még nincs privát kapcsolat létrehozva.";

/* Error string for OTR message string */
"Received an unencrypted message." = "Beérkezett egy titkosítatlan üzenet.";

/* Error string for OTR message string */
"Received and discarded a message intended for another instance." = "Beérkezett és el lett dobva egy másik példányra szánt üzenet.";

/* Error string for OTR message string */
"Received our own OTR messages." = "Beérkeztek a mi saját OTR üzeneteink.";

/* Title for header of Buddy list view with Recent Buddies */
"Recent" = "Újabbak";

/* SSL error message */
"Record overflow" = "Rekord túlcsordulás";

/* Button title to reject a request such as a buddy request */
"Reject" = "Visszautasít";

/* Label for instruction to delete current recording */
"Release to delete" = "Release to delete";

/* Label for instruction to send current audio */
"Release to send" = "Release to send";

/* Label for switch to save passphrase */
"Remember Passphrase" = "Jelmondat megjegyzése";

/* label for switch for whether or not we should save their password between launches */
"Remember password" = "Jelszó megjegyzése";

/* The String for a button to remove a buddy from the buddy list */
"Remove" = "Eltávolít";

/* No comment provided by engineer. */
"Removed By Server" = "Removed By Server";

/* Reply to an incoming message */
"Reply" = "Válasz";

/* String to let user know a certain field like a password is required to create an account */
"Required" = "Szükséges";

/* Label for button to resend message. */
"Resend" = "Resend";

/* Ttitle for alert view to resend a message */
"Resend Message" = "Resend Message";

/* Describe what resending will do the %@ will be replaced withe the method OTR/OMEMO/Plaintext */
"Resending this message will use %@." = "Resending this message will use %@.";

/* Label for text input for XMPP resource */
"Resource" = "Forrás";

/* Title for button for saving a setting */
"Save" = "Mentés";

/* Title for listing the user saved SSL certificates */
"Saved Certificates" = "Mentett tanúsítványok";

/* Label for sharing via QR Code */
"Scan QR" = "Scan QR";

/* Label for text field where you search for a buddy */
"Search" = "Keresés";

/* Title heading in settings */
"Security" = "Biztonság";

/* Title of alert box warning about security issues */
"Security Warning" = "Biztonsági figyelmeztetés";

/* The placeholder text in the chat view where the message should go */
"Send %@ encrypted message" = "Send %@ encrypted message";

/* String on button to email feedback */
"Send Feedback" = "Visszajelzés küldése";

/* The placeholder text in the chat view where the message should go */
"Click here to type something..." = "Click here to type something...";

/* Label text for when a transfer is in progress (normally followed by a percent value 34%) */
"Sending" = "Sending";

/* Error string for OTR message string */
"Sent a heartbeat." = "Elküldve egy szívdobbanás.";

/* server selection section title */
"Server" = "Server";

/* SSL error message */
"Server closed session with no notification" = "A kiszolgáló lezárta a folyamatot értesítés nélkül";

/* SSL error message */
"Server has requested a client cert" = "A kiszolgáló kliens tanúsítványt kért";

/* Title for the Settings screen */
"Settings" = "Beállítások";

/* Title for sharing a link to the app */
"Share" = "Megosztás";

/* Label for inviting friends via URL */
"Share Invite" = "Share Invite";

/* No comment provided by engineer. */
"Show Advanced Encryption Settings" = "Show Advanced Encryption Settings";

/* toggle switch for show advanced */
"Show Advanced Options" = "Show Advanced Options";

/* title label for signing up for a new account */
"Sign Up" = "Regisztráció";

/* Label for button to skip this step */
"Skip" = "Kihagyás";

/* A placeholder for a buddy's username like Someone wants to chat. */
"Someone" = "Someone";

/* SSL error message */
"SSL protocol error" = "SSL protokoll hiba";

/* Label for button to take a photo from camera */
"Take Photo" = "Take Photo";

/* No comment provided by engineer. */
"The app crashed last time it was launched. Send a crash report?" = "The app crashed last time it was launched. Send a crash report?";

/* Error string for OTR message string */
"The message received contains malformed data." = "A beérkezett üzenet torz adatot tartalmaz.";

/* Error string for OTR message string */
"The previous message was resent." = "Az előző üzenet újra lett küldve.";

/* Error message for when in band registration is not supported */
"The XMPP server does not support in-band registration" = "Az XMPP kiszolgáló nem támogatja a sávon belüli regisztrációt";

/* basic setup selection footer */
"Think of a unique nickname that you don't use anywhere else and doesn't contain personal information." = "Think of a unique nickname that you don't use anywhere else and doesn't contain personal information.";

/* Error message when trying to make a purchase but payments haven't been set up yet */
"This device doesn't seem to be configured to make payments." = "Úgy tűnik, hogy ez az eszköz nincs konfigurálva, hogy fizessen.";

/* Error message description */
"This message was received from an untrusted device." = "This message was received from an untrusted device.";

/* Error message description */
"This message was sent to an untrusted device." = "This message was sent to an untrusted device.";

/* microphone permission is disabled */
"To use this feature you must re-enable microphone permissions." = "To use this feature you must re-enable microphone permissions.";

/* Message for warning about using tor network */
"Tor is an experimental feature, please use with caution." = "A Tor egy kísérleti funkció, kérlek óvatosan használd.";

/* Name of the popular social tweeting site */
"Twitter" = "Twitter";

/* Title for error message */
"Unable to Send Message" = "Unable to Send Message";

/* SSL error message */
"Underlying cryptographic error" = "Alap kriptográfiai hiba";

/* SSL error message */
"Unexpected (skipped) record in DTLS" = "Váratlan (átugrott) rekord a DTLS-ben";

/* SSL error message */
"Unexpected message received" = "Váratlan üzenet érkezett";

/* SSL error message */
"Unknown Cert Authority" = "Ismeretlen Tanúsítvány Hatóság";

/* SSL error message */
"Unknown certificate" = "Ismeretlen tanúsítvány";

/* Describes an error without a known cause */
"Unknown Error" = "Unknown Error";

/* Label for button to unlock app */
"Unlock" = "Feloldás";

/* shown when invite QR code doesnt work */
"Unrecognized Invite Format" = "Unrecognized Invite Format";

/* Title for error message */
"Untrusted Device" = "Untrusted Device";

/* SSL error message */
"User canceled" = "Felhasználó megszakította";

/* Example of a username using the words user and example */
"user@example.com" = "user@example.com";

/* Label text for username field on login screen */
"Username" = "Felhasználónév";

/* SSL error message */
"Valid cert chain, untrusted root" = "Érvényes tanúsítvány lánc, megbízhatatlan root";

/* shown to show that the certificate was valid to the system */
"Valid certificate" = "Érvényes tanúsítvány";

/* To let the user know the fingerprint as been checked */
"Verified" = "Ellenőrzött";

/* Shown when verifying fingerprints */
"Verify" = "Megerősítés";

/* Title of the dialog for fingerprint verification */
"Verify Fingerprint" = "Ujjlenyomat megerősítése";

/* when displaying version numbers such as 1.0.0 */
"Version" = "Kiadás";

/* The label for a button to view the buddy profile */
"View Profile" = "View Profile";

/* Describe how to change a contact's device settings */
"View profile to review contact's devices or change encryption settings." = "View profile to review contact's devices or change encryption settings.";

/* Label text for when a transfer has not started yet */
"Waiting" = "Waiting";

/* This string follows a user's dislplay name or username ex Bob wants to chat. */
"wants to chat." = "wants to chat.";

/* help text for password generator */
"We can automatically generate you a secure password. If you choose your own, make sure it's a unique password you don't use anywhere else." = "We can automatically generate you a secure password. If you choose your own, make sure it's a unique password you don't use anywhere else.";

/* Error message for not finding any devices */
"We could not find any trusted devices for this account." = "We could not find any trusted devices for this account.";

/* Error message for not finding any devices */
"We could not find any trusted devices for this contact." = "We could not find any trusted devices for this contact.";

/* actionsheet for showing uservoice feedback service */
"Would you like to connect to UserVoice to send feedback?" = "Szeretnél kapcsolódni az UserVoice-hoz, hogy visszajelzést küldj?";

/* Title for xmpp accounts that connect through the Tor network */
"XMPP + Tor" = "XMPP + Tor";

/* String used when onboarding works */
"You're ready to use" = "You're ready to use";

/* Message shown when about to donate */
"Your donation will help fund the continued development of ChatSecure." = "A támogatásod segíteni fog megalapozni a ChatSecure folytatott fejlesztését.";

/* Text that describes what remembering your passphrase does */
"Your password will be stored in the iOS Keychain of this device only, and is only as safe as your device passphrase or pin. However, it will not persist during a device backup/restore via iTunes, so please don't forget it, or you may lose your conversation history." = "A jelszavad ezen eszköz IOS Kulcskarikáján lesz tárolva csak és csak annyira van biztonságban, mint az eszközöd jelmondata vagy pinje. Azonban nem fog megmaradni iTunes-sal való eszköz biztonsági mentés/visszaállítás alatt, így kérlek ne felejtsd el, vagy elveszítheted a beszélgetési előzményedet.";

